Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_Framework_Swift/Framework_Swift-level2_source2.tmx
Source language: en_us
Languages: ja

source: The three cases of ComparisonResult—ComparisonResult.orderedAscending, ComparisonResult.orderedSame, and ComparisonResult.orderedDescending—are an example of a finite set.
ja: ComparisonResultの３つのケース節 —ComparisonResult.orderedAscending、ComparisonResult.orderedSame、そしてComparisonResult.orderedDescending— はある有限な集合の一例です。

source: The three states are captured by different combinations of the two variables.
ja: ３つの状態は、２つの変数の異なる組み合わせによって捕えられます。

source: The total number of elements that the set can contain without allocating new storage.
ja: その集合が新しいストレージを割り当てることなく含むことができる要素の総数。

source: The two arguments must have the same Element type.
ja: ２つの引数は、同じElement型を持たなければなりません。

source: The two loops in the following example produce the same output:
ja: 以下の例における２つのループは、同じ出力を生み出します：

source: The two variables have an unused combination—it’s possible to set the user to nil and sessionExpired to true, even though that doesn’t have a corresponding state.
ja: ２つの変数は使われない組み合わせを持ちます — userをnilにそしてsessionExpiredをtrueに設定することは可能です、たとえそれが対応する状態を持たないとしてもです。

source: The type for which the expression describes a range.
ja: それに対してこの式が範囲を記述する型。

source: The type of a Combine publisher that publishes the value of a Swift optional instance to each subscriber exactly once, if the instance has any value at all.
ja: あるCombineパブリッシャーの型、それはあるSwiftオプショナルインスタンスの値を各加入者に正確に一度だけ発行するものです、とにかくそのインスタンスが値を何らかの持つならば。

source: The type of a Combine publisher that publishes this instance’s result to each subscriber exactly once, or fails immediately if the result indicates failure.
ja: あるCombineパブリッシャーの型、それはこのインスタンスのもつ結果を各加入者に正確に一度だけ発行する、または結果が不成功を指し示すならば直ぐに失敗するものです。

source: The type of element traversed by the iterator.
ja: このイテレータによって辿っていかれる要素の型。

source: The type of scalars in the vector space.
ja: このベクタースペースの中のスカラーそれらの型。

source: The type of the elements of an array literal.
ja: 配列リテラルの要素の型。

source: The type of the shared actor instance that will be used to provide mutually-exclusive access to declarations annotated with the given global actor type.
ja: 共有アクターインスタンスの型、それは与えられたグローバルアクター型で注釈を付けられた宣言への相互排他アクセスを提供するために使われます。

source: The type of value to decode.
ja: この型の値にデコードする。

source: The type used to represent substructure.
ja: 下位構造体を表すために使われる型。

source: The types of shortForm and longForm in the following code sample are the same:
ja: 以下のコード例におけるshortFormとlongFormの型は、同じです：

source: The underlying iterator whose elements are being filtered.
ja: 基礎をなすイテレータ、それの要素がフィルタされています。

source: The underlying iterator’s sequence may be infinite.
ja: 基礎をなすイテレータのもつシーケンスは、無限であるかもしれません。

source: The underlying type a 64-bit integer uses when it wraps itself in a data value.
ja: 64ビット整数が、それがそれ自身をあるデータ値の中にラップする時に使う、基礎をなす型。

source: The upper and lower bounds of the bounds range must be valid indices of the collection.
ja: bounds範囲の上方および下方の境界は、このコレクションの有効なインデックスでなければなりません。

source: The upper bound for the randomly generated value.
ja: この無作為に生成される値に対する上方の境界。

source: The upper bound for the range.
ja: 範囲の上側の境界。

source: The valid indices for subscripting the vector.
ja: ベクターに添え字での指定をするための有効なインデックスそれら。

source: The value associated with key may be a null value as appropriate for the data format.
ja: keyと結び付けられる値は、null値かもしれません、データ形式として適切であるので。

source: The value associated with the given key may be a null value as appropriate for the data format.
ja: 与えられたキーと結び付けられる値は、そのデータ形式に適切であるnull値であるかもしれません。

source: The value of maxLength must be greater than or equal to zero.
ja: maxLengthの値は、ゼロより大きいか等しくなければなりません。

source: The value of every element in this collection.
ja: このコレクションのすべての要素の値。

source: The value of the member parameter if it was a member of the set; otherwise, nil.
ja: memberパラメータの値、それが集合のメンバであったならば；そうでなければ、nil。

source: The value of this property must always evaluate to the same actor instance.
ja: このプロパティの値は、同じアクターインスタンスと常に等しくなければなりません。

source: The value of this property must be equivalent to shared.unownedExecutor.
ja: このプロパティの値は、shared.unownedExecutorと等しくなければなりません。

source: The value passed as distance must not offset i beyond the bounds of the collection, unless the index passed as limit prevents offsetting beyond those bounds.
ja: distanceとして渡される値は、このコレクションの境界を越えてiを補ってはなりません、limitとして渡されるインデックスがそれら境界を越えて補うのを防止するのでない限りは。

source: The value passed as distance must not offset i beyond the bounds of the collection.
ja: distanceとして渡される値は、このコレクションの境界を越えてiを補ってはなりません。

source: The value passed as source must be representable in this type.
ja: sourceとして渡される値は、この型において表現可能でなければなりません。

source: The value to add to this value.
ja: この値に加える値。

source: The value to calculate the distance to.
ja: それへの隔たりを計算される値。

source: The value to create.
ja: 作成されることになる値。

source: The value to divide lhs by.
ja: この値でlhsを除算します。

source: The value to divide this value by.
ja: この値を除算するための値。

source: The value to divide.
ja: 除算することになる値。

source: The value to encode.
ja: エンコードする値。

source: The value to multiply by this value.
ja: この値と掛け合わせられることになる値。

source: The value to multiply this value by.
ja: この値に掛ける値。

source: The value to shift.
ja: シフトする値。

source: The value to subtract from lhs.
ja: lhsから減じる値。

source: The value to subtract from this value.
ja: この値から減じる値。

source: The value to test.
ja: テストする値。

source: The value to use as the initial accumulating value.
ja: 最初から蓄積されている値として使われる値。

source: The vector to convert.
ja: 変換するベクター。

source: The wrapped value of this instance, unwrapped without checking whether the instance is nil.
ja: インスタンスのラップされた値、そのインスタンスがnilかどうか確認せずにアンラップされます。

source: The wrapping difference of two vectors.
ja: ラップしている、２つのベクターの差。

source: The wrapping sum of two vectors.
ja: ラップしている、２つのベクターの和。

source: The zero value.
ja: ゼロ値。

source: The “past the end” index of the resulting subsequence.
ja: 結果のシーケンスの「終わりを過ぎた」インデックス。

source: The “past the end” position for the set—that is, the position one greater than the last valid subscript argument.
ja: 集合に対する「終わりを過ぎた」位置—すなわち、最後の有効な添え字引数より１つ大きい位置。

source: There is no notion of identity for structs, enums, functions, or tuples.
ja: 構造体、列挙、関数、またはタプルに対して識別の観念はありません。

source: There's no guarantee that the random guess will be correct, so important actions like paying bills—scheduled for after you win the lottery—might never happen.
ja: ランダムな推測が正しくなる保証はありません、それで請求書を払うような — あなたが宝くじに当たった後に予定される — 重要な行為は決して起こらないかもしれません。

source: Therefore, options is emptied and the intersection between .express and options is returned.
ja: したがって、optionsは空にされて.expressとoptionsの間の交叉が返されます。

source: Therefore, the class you migrate can't have any Objective-C subclasses.
ja: したがって、あなたが移行するクラスは、いかなるObjective-Cサブクラスも持つことができません。

source: Therefore, the fundamental difference between random-access and bidirectional collections is that operations that depend on index movement or distance measurement offer significantly improved efficiency.
ja: それゆえに、無作為アクセスと二方向性のコレクションの根本的な違いは、インデックス移動や間隔測定に依存する演算が、著しく改善される効率を提示することです。

source: These accesses may be merged, eliminated, and rearranged with other work, and they may even be introduced when not strictly required.
ja: これらのアクセスは、他の仕事によって合併、排除、そして再配列されるかもしれません、そしてそれらは厳密には必要とされない時に始められさえするかもしれません。

source: These counters can be used as indices only in instances of zero-based, integer-indexed collections, such as Array and ContiguousArray.
ja: これらのカウンタはインデックスとして使われることが、ゼロ基盤の、整数インデックスでのコレクション、例えばArrayそしてContiguousArrayなどのインスタンスにおいてのみ可能です。

source: These elements are computed lazily, each time they’re read, by calling the transform function on a base element.
ja: これらの要素は、それらが読み出されるたびに、基盤要素上で変換関数を呼び出すことによって遅延計算されます。

source: These initializer overloads are available for any conforming type with a RawValue that is a Decodable standard library type.
ja: これらのイニシャライザオーバーロードは、Decodable標準ライブラリ型であるRawValueを持つどんな準拠する型でも利用可能です。

source: These overloads are available for any conforming type with a RawValue that is an Encodable standard library type.
ja: これらのイニシャライザオーバーロードは、Encodable標準ライブラリ型であるRawValueを持つどんな準拠する型でも利用可能です。

source: These pointers are valid only for the duration of the call to body.
ja: これらのポインタは、ただbodyへの呼び出しの間にのみ有効とされます。

source: They may be called once, many times, or never.
ja: それらが呼び出されるのは、一度だけ、何度も、または決してないかもしれません。

source: They're the only logical cases for performing an ordered comparison during tasks like sorting.
ja: それらは、ソートのようなタスクの間に順序あり比較を実行するための論理的な場合にのみのものです。

source: This approach defines an App class with a nested State enumeration that includes only the specific states you need:
ja: この取り組みは、Appクラスを、あなたが必要とする特定の状態のみを含むState列挙とともに定義します：

source: This associated type appears as a requirement in the Sequence protocol, but it is restated here with stricter constraints.
ja: この関連型は、Sequenceプロトコルの中のある要件として現れます、しかしここでより厳格な制約で言い直されます。

source: This capability can be especially important when the order of elements in the literal is significant.
ja: この能力は、そのリテラル中の要素の順序が意味を持つ場合に特に重要となりえます。

source: This case is the default when initializing a Mirror instance.
ja: この場合が、Mirrorインスタンスを初期化する時の省略時の方法です。

source: This characteristic facilitates compatibility with C, which allows any value to be stored in an enumeration, including values used internally but not exposed in headers.
ja: この特徴は、Cとの互換性を容易にします、それはどんな値も列挙に格納されることを許します、内部的に使われるがヘッダに暴露されない値も含めて。

source: This documentation comment was inherited from Actor.
ja: この文書化コメントは、Actorから引き継がれました。

source: This documentation comment was inherited from BidirectionalCollection.
ja: この文書化コメントは、BidirectionalCollectionから引き継がれました。

source: This documentation comment was inherited from BinaryInteger.
ja: この文書化コメントは、BinaryIntegerから引き継がれました。

source: This documentation comment was inherited from Collection.
ja: この文書化コメントは、Collectionから引き継がれました。

source: This documentation comment was inherited from Comparable.
ja: この文書化コメントは、Comparableから引き継がれました。

source: This documentation comment was inherited from CustomDebugStringConvertible.
ja: この文書化コメントは、CustomDebugStringConvertibleから引き継がれました。

source: This documentation comment was inherited from CustomReflectable.
ja: この文書化コメントは、CustomReflectableから引き継がれました。

source: This documentation comment was inherited from CustomStringConvertible.
ja: この文書化コメントは、CustomStringConvertibleから引き継がれました。

source: This documentation comment was inherited from Decodable.
ja: この文書化コメントは、Decodableから引き継がれました。

source: This documentation comment was inherited from Encodable.
ja: この文書化コメントは、Encodableから引き継がれました。

source: This documentation comment was inherited from Equatable.
ja: この文書化コメントは、Equatableから引き継がれました。

source: This documentation comment was inherited from ExpressibleByArrayLiteral.
ja: この文書化コメントは、ExpressibleByArrayLiteralから引き継がれました。

source: This documentation comment was inherited from ExpressibleByIntegerLiteral.
ja: この文書化コメントは、ExpressibleByIntegerLiteralから引き継がれました。

source: This documentation comment was inherited from FixedWidthInteger.
ja: この文書化コメントは、FixedWidthIntegerから引き継がれました。

source: This documentation comment was inherited from GlobalActor.
ja: この文書化コメントは、GlobalActorから引き継がれました。

source: This documentation comment was inherited from Hashable.
ja: この文書化コメントは、Hashableから引き継がれました。

source: This documentation comment was inherited from Identifiable.
ja: この文書化コメントは、Identifiableから引き継がれました。

source: This documentation comment was inherited from IteratorProtocol.
ja: この文書化コメントは、IteratorProtocolから引き継がれました。

source: This documentation comment was inherited from KeyedEncodingContainerProtocol.
ja: この文書化コメントは、KeyedEncodingContainerProtocolから引き継がれました。

source: This documentation comment was inherited from LazySequenceProtocol.
ja: この文書化コメントは、LazySequenceProtocolから引き継がれました。

source: This documentation comment was inherited from MutableCollection.
ja: この文書化コメントは、MutableCollectionから引き継がれました。

source: This documentation comment was inherited from RandomAccessCollection.
ja: この文書化コメントは、RandomAccessCollectionから引き継がれました。

source: This documentation comment was inherited from RangeExpression.
ja: この文書化コメントは、RangeExpressionから引き継がれました。

source: This documentation comment was inherited from SIMD.
ja: この文書化コメントは、SIMDから引き継がれました。

source: This documentation comment was inherited from SIMDStorage.
ja: この文書化コメントは、SIMDStorageから引き継がれました。

source: This documentation comment was inherited from Sequence.
ja: この文書化コメントは、Sequenceから引き継がれました。

source: This documentation comment was inherited from Strideable.
ja: この文書化コメントは、Strideableから引き継がれました。

source: This documentation contains preliminary information about an API or technology in development.
ja: この文書は、開発でのテクノロジーまたはAPIのための事前の情報を含んでいます。

source: This example allocates uninitialized raw memory with space for four instances of Point.
ja: この例は、未初期化の生のメモリをPointの４つのインスタンス用の空間でアロケートします。

source: This example appends the elements of a Range<Int> instance to an array of integers.
ja: 例えば、あなたはあるRange<Int>インスタンスに属する複数要素を整数の配列に追加することができます。

source: This example checks to see whether a favorite actor is in an array storing a movie’s cast.
ja: この例は、映画出演者を格納する配列の中にお気に入りの俳優がいるかどうか確認するために調べます。

source: This example checks to see whether a particular insect is in an array.
ja: この例は、ある特定の昆虫が配列の中にあるかどうか見るために調べます。

source: This example creates a ClosedRange<Character> from “a” up to, and including, “z”.
ja: この例は、「a」から「z」までの、そしてそれを含むClosedRange<Character>を作成します。

source: This example creates a PartialRangeFrom<Double> instance that includes any value greater than or equal to 5.0.
ja: この例は、PartialRangeFrom<Double>インスタンスで5.0より大きいか等しい何らかの値を含むものを作成します。

source: This example creates a PartialRangeThrough<Double> instance that includes any value less than or equal to 5.0.
ja: この例は、PartialRangeThrough<Double>インスタンスで5.0より少ないか等しい何らかの値を含むものを作成します。

source: This example creates a PartialRangeUpTo<Double> instance that includes any value less than 5.0.
ja: この例は、PartialRangeUpTo<Double>インスタンスで5.0より少ない何らかの値を含むものを作成します。

source: This example creates a Range<Double> from zero up to, but not including, 5.0.
ja: この例は、ゼロから5.0までの、しかしそれを含めないRange<Double>を作成します。

source: This example creates an instance of ShippingOptions with a raw value beyond the highest element, with a bit mask that effectively contains all the declared static members.
ja: この例は、ShippingOptionsのインスタンスを最も高い要素を越える生の値で、全ての宣言済み静的メンバを実質的に含むあるビットマスクで、作成します。

source: This example creates three new values in the range 1...100.
ja: この例は、３つの新しい値を範囲1...100において作成します。

source: This example creates three new values in the range 1..<100.
ja: この例は、３つの新しい値を範囲1..<100において作成します。

source: This example declares a constant with three currently allowed moves.
ja: この例は３つの現在許される動きを持つある定数を宣言します。

source: This example demonstrates getting a slice of an array of strings, finding the index of one of the strings in the slice, and then using that index in the original array.
ja: この例は文字列からなる配列のあるスライスの取得を実演します、スライスの中の文字列の１つのインデックスを見つけて、それからそのインデックスを元の配列において使います。

source: This example enumerates the characters of the string “Swift” and prints each character along with its place in the string.
ja: この例は文字列「Swift」の文字を列挙します、そして各文字をその文字列でのそれの場所とともに出力します。

source: This example finds the index of the last name that begins with the letter A:
ja: この例は、文字A:で始まる、最後の名前のインデックスを見つけます：

source: This example finds the largest value in an array of height measurements.
ja: この例は、身長計測の配列の中で最も大きな値を見つけます。

source: This example finds the smallest value in an array of height measurements.
ja: この例は、身長計測の配列の中で最も小さな値を見つけます。

source: This example iterates over the indices and elements of a set, building a list consisting of indices of names with five or fewer letters.
ja: この例は、ある集合のインデックスと要素のすべてにわたって反復します、５つまたはより少ない文字を持つ名前のインデックスから成るリストを作ります。

source: This example performs an arithmetic operation on an optional integer.
ja: この例は、算術演算をあるオプショナル整数上で実行します。

source: This example performs an arithmetic operation with an optional result on an optional integer.
ja: この例は、オプショナル結果をもつ算術演算をあるオプショナル整数上で実行します。

source: This example picks a name at random from an array:
ja: この例は、ある名前を無作為に配列から選出します。

source: This example prints the characters of a string in reverse order:
ja: この例は、ある文字列に属する文字を逆順で出力します。

source: This example removes all the odd values from an array of numbers:
ja: この例は、数値からなる配列から全ての奇数値を除去します。

source: This example removes all the vowels from a string:
ja: この例は、全ての母音を文字列から除去します：

source: This example removes the element "sugar" from a set of ingredients.
ja: この例は、要素"sugar"を一揃いの材料から削除します。

source: This example removes the middle element from an array of measurements.
ja: この例は、測定結果からなる配列から真ん中の要素を削除します。

source: This example removes three elements from the middle of an array of measurements.
ja: この例は、測定結果からなる配列の真ん中から３つの要素を削除します。

source: This example searches streetsSlice for one of the strings in the slice, and then uses that index in the original array.
ja: この例は、streetsSliceをスライスの中の文字列の１つについて検索して、それからそのインデックスを元々の配列において使います。

source: This example shows how an array of [Int] instances can be joined, using another [Int] instance as the separator:
ja: この例は、どのようにいくつかの[Int]インスタンスからなる配列が別の[Int]インスタンスを分離子として使ってつなぎ合わされるかを示します。

source: This example shows how to build a dictionary of letter frequencies of a string.
ja: この例は、ある文字列の文字頻度の辞書を作り上げる方法を示します。

source: This example shows how to find the sum of an array of numbers.
ja: この例は、どのように数からなる配列の合計を見出すかを示します。

source: This example shows how to use the max(by:) method on a dictionary to find the key-value pair with the highest value.
ja: この例は、max(by:)メソッドを辞書上で使って、最も高い値を持つキー値ペアを見つける方法を示します。

source: This example shows how to use the min(by:) method on a dictionary to find the key-value pair with the lowest value.
ja: この例は、min(by:)メソッドを辞書上で使って、最も低い値を持つキー値ペアを見つける方法を示します。

source: This example shows how you can check an array for an expense greater than $100.
ja: この例は、どのようにあなたが$100より大きい出費についてある配列を調べるかを示します。

source: This example shows how you can modify one of the names in an array of students.
ja: この例が示すのは、どうやってあなたが学生らの配列の中の名前の１つを修正できるかです。

source: This example shows two overlapping ranges:
ja: この例は２つの重なった範囲を示します：

source: This example tests whether one countable range begins with the elements of another countable range.
ja: この例は、ある可付番範囲が別の可付番範囲の要素で始まるかどうかテストします。

source: This example tests whether one countable range shares the same elements as another countable range and an array.
ja: この例は、ある可付番範囲が同じ要素を別の可付番範囲とそしてある配列と共有するかどうかをテストします。

source: This example uses the contains(_:) method to check whether next-day shipping is in the availableOptions instance.
ja: この例は、contains(_:)メソッドを使って翌日出荷がavailableOptionsインスタンスの中のあるかどうか確認します。

source: This example uses the contains(_:) method to test whether an integer is a member of a set of prime numbers.
ja: この例は、contains(_:)メソッドを使ってある整数がある一揃いの素数のメンバであるかどうかをテストします。

source: This example uses the intersection(_:) method to limit the available shipping options to what can be used with a PO Box destination.
ja: この例は、intersection(_:)メソッドを使って、利用可能な出荷オプションを私書箱宛先で使われるものに制限します。

source: This example uses the last(where:) method to find the last negative number in an array of integers:
ja: この例は、last(where:)メソッドを使って、整数の配列において最後の負数を見つけます：

source: This example uses the lexicographicallyPrecedes method to test which array of integers comes first in a lexicographical ordering.
ja: この例はlexicographicallyPrecedesメソッドを使って、どの整数配列がある語彙筆記的順序において最初に来るかをテストします。

source: This example uses the union(_:) method to add two more shipping options to the default set.
ja: この例は、union(_:)メソッドを使って２つのさらなる出荷オプションを省略時のセットに加えます。

source: This function does not infer element moves.
ja: この関数は、要素が移動することを推測しません。

source: This function is suitable for exploring the structure of a mirror in a REPL or playground, but is not intended to be efficient.
ja: この関数は、REPLまたはプレイグラウンドにおいてミラーの構造体を探索するのに適します、しかし効率を考慮されません。

source: This function is the only requirement of the Comparable protocol.
ja: この関数は、Comparableプロトコルのただ１つの要件です。

source: This function throws an error if any values are invalid for the given encoder’s format.
ja: この関数は、与えられたエンコーダの形式に対して何らかの値が無効であるならばエラーをスローします。

source: This header may be nontrivial to compute; it is usually a good idea to store this information in the “header” area when an instance is created.
ja: このヘッダを計算するのは、些細なことではありません；通常良い考えであるのは、この情報をインスタンスが作成されるときに「ヘッダ」領域に格納することです。

source: This information is subject to change, and software implemented according to this documentation should be tested with final operating system software.
ja: この情報は変更される場合があり、この文書に沿って実装されるソフトウェアは最終的なオペレーティングシステム・ソフトウェアでテストされなければなりません。

source: This initializer always succeeds, even if the value passed as rawValue exceeds the static properties declared as part of the option set.
ja: このイニシャライザは常に成功します、rawValueとして渡される値がオプションセットの部分として宣言される静的プロパティを上回るとしてもです。

source: This initializer can also be used to restore set methods after performing sequence operations such as filter(_:) or map(_:) on a set.
ja: このイニシャライザはまた、シーケンス演算、例えばfilter(_:)やmap(_:)などをある集合上で実行した後で集合に戻す手法として使われることができます。

source: This initializer creates an option set with a raw value of zero.
ja: このイニシャライザは、０個の生の値を持つオプションセットを作成します。

source: This initializer does not perform any range or overflow checking.
ja: このイニシャライザは、全く範囲またはオーバーフロー検査を実行しません。

source: This initializer is equivalent to initializing with an empty array literal.
ja: このイニシャライザは空の配列リテラルで初期化するのと等しいです。

source: This initializer is failable because although every case of the Counter type has a corresponding Int value, there are many Int values that don’t correspond to a case of Counter.
ja: このイニシャライザは失敗可能です、なぜならすべてのCounter型のケース節は対応するInt値を持つけれども、Counterのケース節に対応しない多くのInt値が存在するからです。

source: This initializer throws an error if reading from the decoder fails, or if the data read is corrupted or otherwise invalid.
ja: このイニシャライザは、デコーダからの読み出しが失敗するならば、または読み込んだデータが不正またはそうでなくとも無効ならば、エラーをスローします。

source: This initializer works with any type, and uses the custom debugDescription property for types that conform to CustomDebugStringConvertible:
ja: このイニシャライザはどんな型とでも働きます、そしてあつらえのdebugDescriptionプロパティをCustomDebugStringConvertibleに準拠する型に対して使います：

source: This initializer works with any type, and uses the custom description property for types that conform to CustomStringConvertible:
ja: このイニシャライザはどんな型とでも働きます、そしてあつらえのdescriptionプロパティをCustomStringConvertibleに準拠する型に対して使います：

source: This is equivalent to initializing with an empty array literal.
ja: これは空の配列リテラルで初期化するのに等しいです。

source: This is equivalent to the following conditional in Swift:
ja: これは、Swiftでの以下の条件文に相当します：

source: This is equivalent to the inverse of a set.
ja: これはある集合の逆と等しいです。

source: This is equivalent to using the @available attribute on a declaration in Swift:
ja: これは、@availableをSwiftにおける宣言上で使うことに相当します：

source: This is the associated Iterator of LazyFilterSequence and LazyFilterCollection.
ja: これはLazyFilterSequenceとLazyFilterCollectionに関連するIteratorです。

source: This is the associated iterator for the LazyDropWhileSequence, LazyDropWhileCollection, and LazyDropWhileBidirectionalCollection types.
ja: これは、LazyDropWhileSequence、LazyDropWhileCollection、そしてLazyDropWhileBidirectionalCollection型に対する関連イテレータです。

source: This is the associated iterator for the LazyPrefixWhileSequence, LazyPrefixWhileCollection, and LazyPrefixWhileBidirectionalCollection types.
ja: これは、LazyPrefixWhileSequence、LazyPrefixWhileCollection、そしてLazyPrefixWhileBidirectionalCollection型に対する関連イテレータです。

source: This is the default implementation of the greater-than operator (>) for any type that conforms to Comparable.
ja: Comparableに準拠するあらゆる型に対して、より大きい演算子（>）の初期状態の実装です。

source: This is the default implementation of the greater-than-or-equal-to operator (>=) for any type that conforms to Comparable.
ja: Comparableに準拠するあらゆる型に対して、より大きいか等しい演算子（>=）の初期状態の実装です。

source: This is the default implementation of the less-than-or-equal-to operator (<=) for any type that conforms to Comparable.
ja: Comparableに準拠するあらゆる型に対して、より少ないか等しい演算子（<=）の初期状態の実装です。
